# 4.1[22]: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах. Если таких чисел нет - выдать внятное диагностическое сообщение
#
# Наборы (списки) чисел можно считать заданными и не вводить с клавиатуры
#
# 	Примеры/Тесты:
#     Input1: 2 4 6 8 10 12 10 8 6 4 2
#     Input2: 3 6 9 12 15 18
#     Output: 6 12     Обратите внимание: Без скобочек, в одну строку
#
#     Input1: 2 4 6 8 10 10 8 6 4 2
#     Input2: 3 9 12 15 18
#     Output: Повторяющихся чисел нет

set_1 = {2, 4, 6, 8, 10, 12, 10, 8, 6, 4, 2}
set_2 = {3, 6, 9, 12, 15, 18}

intersection_set = set_1 & set_2

# Мне пришлось использовать sorted т.к. после пересечения set был отсортирован по убыванию
# print(" ".join(map(str, sorted(intersection_set))) if len(intersection_set) else "Повторяющихся чисел нет")
# Альтернативное решение
if len(intersection_set):
    print(*sorted(intersection_set))
else:
    print("Повторяющихся чисел нет")
