# 4.2[24]: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом. На входе задано количество ягод на каждом кусте. Не обязательно вводить их с клавиатуры, можно задать непосредственно в коде программы
#
#     Примеры/Тесты:
#     Input1: 1, 2, 3, 4, 5, 6, 7, 8
#     Output1: Макс. кол-во ягод 21, собрано для куста 7
#
#     Input1: 11, 92, 1, 42, 15, 12, 11, 81
#     Output1: Макс. кол-во ягод 184, собрано для куста 1

input_data = [1, 2, 3, 4, 5, 6, 7, 8]

bushes_in_one_go = 3

# iteration start
# Начинаем с отрицательных значений, чтобы захватить все пары граничных индексов массива
i = 1 - bushes_in_one_go
max_berries = 0
max_bush_num = i + bushes_in_one_go // 2

while i < len(input_data) - bushes_in_one_go + 1:
    j = 0
    current_max_berries = 0
    while j < bushes_in_one_go:
        current_max_berries += input_data[i+j]
        j += 1
    if current_max_berries > max_berries:
        max_berries = current_max_berries
        max_bush_num = i + bushes_in_one_go // 2
    i += 1

# max_bush_num+1 т.к. считаем с 0, а выводим с 1
print(max_berries, max_bush_num+1)
