# 1.3[6]. Вы пользуетесь общественным транспортом?
# Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.
#
# 	Примеры/Тесты:
# 	385916 >>> yes
# 	123456 >>> no
#
# ```(*)``` **Усложнение.** Вывод результат на экран сделайте одной строкой(только один print), для этого используйте тернарный оператор

ticket_size = 6
user_input = input("Введите номер билета > ")
if not (len(user_input) == ticket_size and user_input.isdigit()):
    print("Это не номер билета, перезапустите программу и попробуйте ещё раз")
    exit(1)

sum_left = 0
sum_right = 0

for i in range(ticket_size//2):
    sum_left += int(user_input[i])
    sum_right += int(user_input[ticket_size-i-1])

print("yes" if sum_left == sum_right else "no")
