# 1.1[2]. Найдите сумму цифр трехзначного числа. Используйте f-строки чтобы оформить красивый вывод
#
# Например для числа 145 сумма цифр будет 10: 1 + 4 + 5
#
# 	Примеры/Тесты:
# 	123 >>> Сумма чисел числа 123 равна 6
# 	100 >>> Сумма чисел числа 100 равна 1
#
# ```(*)``` **Усложнение.** Решите для числа произвольной разрядности: произвольное количество цифр в числе.
#
# ```(**)``` **Усложнение.** Для числа произвольной разрядности добавить в вывод строку с числами, например так:
#
# 	13579 >>> Сумма чисел числа 13579 равна 25(1 + 3 + 5 + 7 + 9)
# Совет: Для этого используйте конкатенацию строк и срезы

user_input = input("Введите число > ")
if not user_input.isdigit():
    print("Вы ввели что-то не то, перезапустите программу и попробуйте ещё раз")
    exit(1)

number_digits_sum = 0

for digit in user_input:
    number_digits_sum += int(digit)

# да, можно внутри цикла собирать строку конкатенацией в отдельную переменную, но зачем, когда есть join()
print(f'Сумма чисел числа {user_input} равна {number_digits_sum}({"+".join(user_input)})')
