# 2.3[14]: Требуется вывести все целые степени двойки (т.е. числа вида 2^k), не превосходящие числа N.
#
# 	Примеры/Тесты:
#     10 ->
#     1
#     2
#     4
#     8
#
# ```(*)``` **Усложнение.** Вывод оформить в одну строку: числа выводить через запятую. Для этого воспользоваться параметрами функции print
#
#     Примеры/Тесты:
#     10     -> 1,2,4,8,
#     10000  -> 1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,

# user_input = input("Введите число > ")
# if user_input.isdigit():
#     coins = int(user_input)
# else:
#     print("Вы ввели что-то не то, перезапустите программу и попробуйте ещё раз")
#     exit(1)
max_number = 10
number = 2
power = 0

while True:
    cur_number = number ** power
    power += 1
    if cur_number < max_number:
        print(cur_number, end=',')
    else:
        break
